{
  "title": "गोपनीयता नीति",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "अवलोकन",
      "content": "Food ID आपकी गोपनीयता की सुरक्षा के लिए प्रतिबद्ध है। यह गोपनीयता नीति बताती है कि जब आप हमारे मोबाइल एप्लिकेशन का उपयोग करते हैं तो हम आपके डेटा और जानकारी को कैसे संभालते हैं। हम पारदर्शिता में विश्वास करते हैं और चाहते हैं कि आप समझें कि आपकी जानकारी का उपयोग और भंडारण कैसे किया जाता है।"
    },
    {
      "id": 2,
      "title": "डेटा संग्रह",
      "content": "Food ID ऐप के काम करने के लिए आवश्यक न्यूनतम डेटा एकत्र करता है। जब आप किसी उत्पाद बारकोड को स्कैन करते हैं, हम OpenFoodFacts सार्वजनिक डेटाबेस से उत्पाद जानकारी पुनर्प्राप्त करते हैं। हम आपका नाम, ईमेल पता, फोन नंबर या स्थान डेटा जैसी व्यक्तिगत जानकारी एकत्र नहीं करते हैं।"
    },
    {
      "id": 3,
      "title": "केवल स्थानीय भंडारण",
      "content": "ऐप के उपयोग से उत्पन्न सभी डेटा विशेष रूप से आपके डिवाइस पर संग्रहीत होते हैं। इसमें शामिल है:\n\n• स्कैन इतिहास: आपके द्वारा स्कैन किए गए उत्पादों की सूची\n• पसंदीदा: आपके द्वारा पसंदीदा के रूप में चिह्नित किए गए उत्पाद\n• उत्पाद कैश: आपके द्वारा देखे गए उत्पादों की पोषण जानकारी\n\nयह डेटा कभी भी आपके डिवाइस को नहीं छोड़ता है और हमारे सर्वर या किसी तीसरे पक्ष को प्रसारित नहीं किया जाता है।"
    },
    {
      "id": 4,
      "title": "कोई डेटा प्रसारण नहीं",
      "content": "Food ID आपके स्कैन इतिहास, पसंदीदा या किसी भी व्यक्तिगत उपयोग डेटा को बाहरी सर्वर पर प्रसारित नहीं करता है। ऐप द्वारा किए गए एकमात्र नेटवर्क अनुरोध OpenFoodFacts API को आपके द्वारा स्कैन किए गए बारकोड के आधार पर सार्वजनिक उत्पाद जानकारी पुनर्प्राप्त करने के लिए हैं।"
    },
    {
      "id": 5,
      "title": "कैमरा उपयोग",
      "content": "ऐप को उत्पाद बारकोड स्कैन करने के लिए कैमरा पहुंच की आवश्यकता होती है। कैमरा का उपयोग केवल बारकोड पहचान के लिए किया जाता है। कोई फोटो या वीडियो कैप्चर, संग्रहीत या प्रसारित नहीं किया जाता है। कैमरा फीड को आपके डिवाइस पर वास्तविक समय में स्थानीय रूप से संसाधित किया जाता है।"
    },
    {
      "id": 6,
      "title": "OpenFoodFacts डेटा",
      "content": "उत्पाद जानकारी OpenFoodFacts से पुनर्प्राप्त की जाती है, जो खाद्य उत्पादों का एक मुफ्त और खुला डेटाबेस है। जब आप एक बारकोड स्कैन करते हैं, तो ऐप उत्पाद जानकारी पुनर्प्राप्त करने के लिए केवल बारकोड नंबर OpenFoodFacts को भेजता है। OpenFoodFacts के साथ कोई व्यक्तिगत डेटा साझा नहीं किया जाता है।"
    },
    {
      "id": 7,
      "title": "डेटा हटाना",
      "content": "आपके पास अपने डेटा पर पूर्ण नियंत्रण है। आप किसी भी समय ऐप के भीतर से अपना स्कैन इतिहास और पसंदीदा साफ कर सकते हैं। ऐप को अनइंस्टॉल करने से आपके डिवाइस से सभी स्थानीय रूप से संग्रहीत डेटा स्थायी रूप से हटा दिया जाएगा, जिसमें स्कैन इतिहास, पसंदीदा और कैश की गई उत्पाद जानकारी शामिल है।"
    },
    {
      "id": 8,
      "title": "तीसरे पक्ष की सेवाएं",
      "content": "Food ID उत्पाद जानकारी पुनर्प्राप्त करने के लिए OpenFoodFacts API का उपयोग करता है। OpenFoodFacts एक स्वतंत्र, गैर-लाभकारी परियोजना है। कृपया उनकी डेटा प्रथाओं के बारे में जानकारी के लिए OpenFoodFacts की गोपनीयता नीति देखें।"
    },
    {
      "id": 9,
      "title": "बच्चों की गोपनीयता",
      "content": "Food ID जानबूझकर बच्चों से कोई व्यक्तिगत जानकारी एकत्र नहीं करता है। ऐप को किसी भी व्यक्ति द्वारा उपयोग करने के लिए डिज़ाइन किया गया है, और चूंकि कोई व्यक्तिगत डेटा एकत्र या प्रसारित नहीं किया जाता है, यह सभी उम्र के उपयोगकर्ताओं के लिए सुरक्षित है।"
    },
    {
      "id": 10,
      "title": "गोपनीयता नीति में परिवर्तन",
      "content": "हम समय-समय पर इस गोपनीयता नीति को अपडेट कर सकते हैं। हम इस नीति के शीर्ष पर 'अंतिम अपडेट' की तारीख अपडेट करके आपको किसी भी परिवर्तन के बारे में सूचित करेंगे। हम आपको किसी भी परिवर्तन के लिए समय-समय पर इस गोपनीयता नीति की समीक्षा करने के लिए प्रोत्साहित करते हैं।"
    },
    {
      "id": 11,
      "title": "हमसे संपर्क करें",
      "content": "यदि इस गोपनीयता नीति या हमारी डेटा प्रथाओं के बारे में आपके कोई प्रश्न या चिंताएं हैं, कृपया ऐप के सहायता चैनलों के माध्यम से हमसे संपर्क करें। हम आपकी किसी भी गोपनीयता चिंता को संबोधित करने के लिए प्रतिबद्ध हैं।"
    }
  ]
}
