{
  "title": "سياسة الخصوصية",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "نظرة عامة",
      "content": "Food ID ملتزم بحماية خصوصيتك. توضح سياسة الخصوصية هذه كيفية تعاملنا مع بياناتك ومعلوماتك عند استخدام تطبيقنا المحمول. نؤمن بالشفافية ونريدك أن تفهم بالضبط كيف يتم استخدام معلوماتك وتخزينها."
    },
    {
      "id": 2,
      "title": "جمع البيانات",
      "content": "يجمع Food ID الحد الأدنى من البيانات اللازمة لعمل التطبيق. عند مسح رمز الباركود للمنتج، نسترجع معلومات المنتج من قاعدة بيانات OpenFoodFacts العامة. لا نجمع معلومات شخصية مثل اسمك أو عنوان بريدك الإلكتروني أو رقم هاتفك أو بيانات الموقع."
    },
    {
      "id": 3,
      "title": "التخزين المحلي فقط",
      "content": "يتم تخزين جميع البيانات الناتجة عن استخدامك للتطبيق حصريًا على جهازك. يتضمن ذلك:\n\n• سجل المسح: قائمة بالمنتجات التي قمت بمسحها\n• المفضلة: المنتجات التي قمت بوضع علامة عليها كمفضلة\n• ذاكرة التخزين المؤقت للمنتجات: المعلومات الغذائية للمنتجات التي عرضتها\n\nلا تغادر هذه البيانات جهازك أبدًا ولا يتم إرسالها إلى خوادمنا أو أي أطراف ثالثة."
    },
    {
      "id": 4,
      "title": "لا يوجد إرسال بيانات",
      "content": "لا يرسل Food ID سجل المسح أو المفضلة أو أي بيانات استخدام شخصية إلى خوادم خارجية. الطلبات الوحيدة للشبكة التي يقوم بها التطبيق هي إلى واجهة برمجة تطبيقات OpenFoodFacts لاسترداد معلومات المنتج العامة بناءً على رموز الباركود التي تمسحها."
    },
    {
      "id": 5,
      "title": "استخدام الكاميرا",
      "content": "يتطلب التطبيق الوصول إلى الكاميرا لمسح رموز الباركود للمنتجات. تُستخدم الكاميرا فقط للتعرف على الباركود. لا يتم التقاط أو تخزين أو إرسال أي صور أو مقاطع فيديو. يتم معالجة بث الكاميرا محليًا على جهازك في الوقت الفعلي."
    },
    {
      "id": 6,
      "title": "بيانات OpenFoodFacts",
      "content": "يتم استرداد معلومات المنتج من OpenFoodFacts، وهي قاعدة بيانات مجانية ومفتوحة للمنتجات الغذائية. عند مسح رمز الباركود، يرسل التطبيق رقم الباركود فقط إلى OpenFoodFacts لاسترداد معلومات المنتج. لا يتم مشاركة أي بيانات شخصية مع OpenFoodFacts."
    },
    {
      "id": 7,
      "title": "حذف البيانات",
      "content": "لديك سيطرة كاملة على بياناتك. يمكنك مسح سجل المسح والمفضلة في أي وقت من داخل التطبيق. إلغاء تثبيت التطبيق سيحذف بشكل دائم جميع البيانات المخزنة محليًا من جهازك، بما في ذلك سجل المسح والمفضلة ومعلومات المنتج المخزنة مؤقتًا."
    },
    {
      "id": 8,
      "title": "خدمات الطرف الثالث",
      "content": "يستخدم Food ID واجهة برمجة تطبيقات OpenFoodFacts لاسترداد معلومات المنتج. OpenFoodFacts هو مشروع مستقل غير ربحي. يرجى الرجوع إلى سياسة الخصوصية الخاصة بـ OpenFoodFacts للحصول على معلومات حول ممارساتهم المتعلقة بالبيانات."
    },
    {
      "id": 9,
      "title": "خصوصية الأطفال",
      "content": "لا يجمع Food ID عن قصد أي معلومات شخصية من الأطفال. تم تصميم التطبيق لاستخدامه من قبل أي شخص، وبما أنه لا يتم جمع أو إرسال أي بيانات شخصية، فهو آمن للمستخدمين من جميع الأعمار."
    },
    {
      "id": 10,
      "title": "تغييرات سياسة الخصوصية",
      "content": "قد نحدث سياسة الخصوصية هذه من وقت لآخر. سنخطرك بأي تغييرات من خلال تحديث تاريخ 'آخر تحديث' في أعلى هذه السياسة. نشجعك على مراجعة سياسة الخصوصية هذه بشكل دوري لأي تغييرات."
    },
    {
      "id": 11,
      "title": "اتصل بنا",
      "content": "إذا كان لديك أي أسئلة أو مخاوف بشأن سياسة الخصوصية هذه أو ممارساتنا المتعلقة بالبيانات، يرجى الاتصال بنا من خلال قنوات دعم التطبيق. نحن ملتزمون بمعالجة أي مخاوف تتعلق بالخصوصية قد تكون لديك."
    }
  ]
}
