{
  "title": "اتفاقية المستخدم",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "قبول الشروط",
      "content": "من خلال تنزيل أو تثبيت أو استخدام تطبيق Food ID المحمول، فإنك توافق على الالتزام بهذه شروط الاستخدام. إذا كنت لا توافق على هذه الشروط، يرجى عدم استخدام التطبيق."
    },
    {
      "id": 2,
      "title": "وصف الخدمة",
      "content": "Food ID هو تطبيق محمول يسمح للمستخدمين بمسح رموز الباركود للمنتجات واسترداد المعلومات الغذائية من قاعدة بيانات OpenFoodFacts. يوفر التطبيق تحليلًا غذائيًا وقوائم مكونات ومعلومات مسببات الحساسية وتقييمات مخصصة لمساعدة المستخدمين على اتخاذ خيارات غذائية مستنيرة."
    },
    {
      "id": 3,
      "title": "مسؤوليات المستخدم",
      "content": "أنت مسؤول عن الحفاظ على سرية جهازك وجميع الأنشطة التي تحدث على جهازك. أنت توافق على استخدام التطبيق فقط للأغراض القانونية ووفقًا لهذه الشروط. أنت توافق على عدم إساءة استخدام التطبيق أو التدخل في عمله الطبيعي."
    },
    {
      "id": 4,
      "title": "دقة البيانات",
      "content": "معلومات المنتج مستمدة من OpenFoodFacts، وهي قاعدة بيانات مدفوعة من المجتمع. بينما نسعى جاهدين لتوفير معلومات دقيقة، لا يمكننا ضمان اكتمال أو دقة جميع بيانات المنتج. يجب على المستخدمين التحقق من المعلومات الحرجة، خاصة فيما يتعلق بمسببات الحساسية، مع تغليف المنتج أو الشركات المصنعة."
    },
    {
      "id": 4.5,
      "title": "المساهمة في بيانات المنتجات",
      "content": "يمكنك المساعدة في تحسين قاعدة البيانات من خلال إرسال المنتجات المفقودة عبر التطبيق. عندما لا يتم العثور على منتج، استخدم ميزة إرسال المنتج لإضافته إلى OpenFoodFacts. من خلال المساهمة، توافق على أن إرسالاتك ستكون متاحة للجمهور بموجب ترخيص Open Database License (ODbL)."
    },
    {
      "id": 5,
      "title": "الملكية الفكرية",
      "content": "التطبيق ومحتواه الأصلي وميزاته ووظائفه مملوكة لـ Food ID ومحمية بموجب قوانين حقوق النشر والعلامات التجارية وقوانين الملكية الفكرية الدولية الأخرى. يتم توفير بيانات المنتج من قبل OpenFoodFacts بموجب ترخيص Open Database License (ODbL)."
    },
    {
      "id": 6,
      "title": "تحديد المسؤولية",
      "content": "لن يكون Food ID ومطوروه مسؤولين عن أي أضرار غير مباشرة أو عرضية أو خاصة أو تبعية أو عقابية ناتجة عن استخدامك أو عدم قدرتك على استخدام التطبيق. نقدم التطبيق 'كما هو' دون ضمانات من أي نوع، صريحة أو ضمنية."
    },
    {
      "id": 7,
      "title": "تغييرات الشروط",
      "content": "نحتفظ بالحق في تعديل هذه الشروط في أي وقت. سنخطر المستخدمين بأي تغييرات من خلال تحديث تاريخ 'آخر تحديث'. استمرارك في استخدام التطبيق بعد التغييرات يشكل قبول الشروط المعدلة."
    },
    {
      "id": 8,
      "title": "الإنهاء",
      "content": "يجوز لنا إنهاء أو تعليق وصولك إلى التطبيق فورًا، دون إشعار مسبق، لأي سبب من الأسباب، بما في ذلك انتهاك هذه الشروط. عند الإنهاء، سينتهي حقك في استخدام التطبيق فورًا."
    },
    {
      "id": 9,
      "title": "اتصل بنا",
      "content": "إذا كان لديك أي أسئلة حول هذه الشروط، يرجى الاتصال بنا من خلال قنوات دعم التطبيق."
    }
  ]
}
