{
  "title": "Kullanıcı sözleşmesi",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Şartların kabulü",
      "content": "Food ID mobil uygulamasını indirerek, yükleyerek veya kullanarak bu Kullanım Şartlarına bağlı kalmayı kabul edersiniz. Bu şartları kabul etmiyorsanız, lütfen uygulamayı kullanmayın."
    },
    {
      "id": 2,
      "title": "Hizmet açıklaması",
      "content": "Food ID, kullanıcıların ürün barkodlarını taramasına ve OpenFoodFacts veritabanından beslenme bilgilerini almasına olanak tanıyan bir mobil uygulamadır. Uygulama, kullanıcıların bilinçli gıda seçimleri yapmasına yardımcı olmak için beslenme analizi, içerik listeleri, alerjen bilgileri ve kişiselleştirilmiş değerlendirmeler sağlar."
    },
    {
      "id": 3,
      "title": "Kullanıcı sorumlulukları",
      "content": "Cihazınızın gizliliğini korumaktan ve cihazınızda meydana gelen tüm faaliyetlerden sorumlusunuz. Uygulamayı yalnızca yasal amaçlar için ve bu Şartlara uygun olarak kullanmayı kabul edersiniz. Uygulamayı kötüye kullanmamayı veya normal işleyişine müdahale etmemeyi kabul edersiniz."
    },
    {
      "id": 4,
      "title": "Veri doğruluğu",
      "content": "Ürün bilgileri, topluluk tarafından yönetilen bir veritabanı olan OpenFoodFacts'tan alınmaktadır. Doğru bilgi sağlamaya çalışsak da, tüm ürün verilerinin eksiksizliğini veya doğruluğunu garanti edemeyiz. Kullanıcılar, özellikle alerjenlerle ilgili kritik bilgileri ürün ambalajı veya üreticilerle doğrulamalıdır."
    },
    {
      "id": 4.5,
      "title": "Ürün verilerine katkıda bulunma",
      "content": "Eksik ürünleri uygulama aracılığıyla göndererek veritabanını iyileştirmeye yardımcı olabilirsiniz. Bir ürün bulunamadığında, onu OpenFoodFacts'a eklemek için Ürün Gönder işlevini kullanın. Katkıda bulunarak, gönderilerinizin Open Database License (ODbL) altında kamuya açık olacağını kabul edersiniz."
    },
    {
      "id": 5,
      "title": "Fikri mülkiyet",
      "content": "Uygulama ve orijinal içeriği, özellikleri ve işlevselliği Food ID'ye aittir ve uluslararası telif hakkı, ticari marka ve diğer fikri mülkiyet yasalarıyla korunmaktadır. Ürün verileri, Open Database License (ODbL) altında OpenFoodFacts tarafından sağlanmaktadır."
    },
    {
      "id": 6,
      "title": "Sorumluluk sınırlaması",
      "content": "Food ID ve geliştiricileri, uygulamayı kullanmanızdan veya kullanamamanızdan kaynaklanan dolaylı, arızi, özel, sonuçsal veya cezai zararlardan sorumlu olmayacaktır. Uygulamayı 'olduğu gibi' açık veya örtülü herhangi bir garanti olmadan sunuyoruz."
    },
    {
      "id": 7,
      "title": "Şartlardaki değişiklikler",
      "content": "Bu Şartları istediğimiz zaman değiştirme hakkını saklı tutarız. 'Son Güncelleme' tarihini güncelleyerek kullanıcıları herhangi bir değişiklikten haberdar edeceğiz. Değişikliklerden sonra uygulamayı kullanmaya devam etmeniz, değiştirilmiş Şartları kabul ettiğiniz anlamına gelir."
    },
    {
      "id": 8,
      "title": "Fesih",
      "content": "Bu Şartların ihlali de dahil olmak üzere herhangi bir nedenle, önceden haber vermeksizin uygulamaya erişiminizi derhal sonlandırabilir veya askıya alabiliriz. Fesih durumunda, uygulamayı kullanma hakkınız derhal sona erecektir."
    },
    {
      "id": 9,
      "title": "İletişim",
      "content": "Bu Şartlar hakkında sorularınız varsa, lütfen uygulamanın destek kanalları aracılığıyla bizimle iletişime geçin."
    }
  ]
}
