{
  "title": "Polityka prywatności",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Przegląd",
      "content": "Food ID zobowiązuje się do ochrony Twojej prywatności. Ta Polityka prywatności wyjaśnia, jak radzimy sobie z Twoimi danymi i informacjami podczas korzystania z naszej aplikacji mobilnej. Wierzymy w przejrzystość i chcemy, abyś dokładnie rozumiał, jak Twoje informacje są używane i przechowywane."
    },
    {
      "id": 2,
      "title": "Zbieranie danych",
      "content": "Food ID zbiera minimalne dane niezbędne do działania aplikacji. Gdy skanujesz kod kreskowy produktu, pobieramy informacje o produkcie z publicznej bazy danych OpenFoodFacts. Nie zbieramy informacji osobistych, takich jak Twoje imię, adres e-mail, numer telefonu lub dane lokalizacji."
    },
    {
      "id": 3,
      "title": "Tylko lokalne przechowywanie",
      "content": "Wszystkie dane wygenerowane przez Twoje korzystanie z aplikacji są przechowywane wyłącznie na Twoim urządzeniu. Obejmuje to:\n\n• Historia skanowań: Lista produktów, które zeskanowałeś\n• Ulubione: Produkty, które oznaczyłeś jako ulubione\n• Pamięć podręczna produktów: Informacje o wartościach odżywczych produktów, które przeglądałeś\n\nTe dane nigdy nie opuszczają Twojego urządzenia i nie są przesyłane do naszych serwerów ani do osób trzecich."
    },
    {
      "id": 4,
      "title": "Brak transmisji danych",
      "content": "Food ID nie przesyła Twojej historii skanowań, ulubionych ani żadnych danych dotyczących użytkowania osobistego do zewnętrznych serwerów. Jedynymi żądaniami sieciowymi wykonywanymi przez aplikację są do interfejsu API OpenFoodFacts w celu pobrania publicznych informacji o produktach na podstawie kodów kreskowych, które skanujesz."
    },
    {
      "id": 5,
      "title": "Użycie kamery",
      "content": "Aplikacja wymaga dostępu do kamery w celu skanowania kodów kreskowych produktów. Kamera jest używana wyłącznie do rozpoznawania kodów kreskowych. Żadne zdjęcia ani filmy nie są przechwytywane, przechowywane ani przesyłane. Strumień kamery jest przetwarzany lokalnie na Twoim urządzeniu w czasie rzeczywistym."
    },
    {
      "id": 6,
      "title": "Dane OpenFoodFacts",
      "content": "Informacje o produkcie są pobierane z OpenFoodFacts, bezpłatnej i otwartej bazy danych produktów spożywczych. Gdy skanujesz kod kreskowy, aplikacja wysyła tylko numer kodu kreskowego do OpenFoodFacts w celu pobrania informacji o produkcie. Żadne dane osobowe nie są udostępniane OpenFoodFacts."
    },
    {
      "id": 7,
      "title": "Usuwanie danych",
      "content": "Masz pełną kontrolę nad swoimi danymi. Możesz wyczyścić historię skanowań i ulubione w dowolnym momencie w aplikacji. Odinstalowanie aplikacji trwale usunie wszystkie dane przechowywane lokalnie z Twojego urządzenia, w tym historię skanowań, ulubione i informacje o produktach w pamięci podręcznej."
    },
    {
      "id": 8,
      "title": "Usługi stron trzecich",
      "content": "Food ID używa interfejsu API OpenFoodFacts do pobierania informacji o produktach. OpenFoodFacts to niezależny projekt non-profit. Zapoznaj się z polityką prywatności OpenFoodFacts, aby uzyskać informacje o ich praktykach dotyczących danych."
    },
    {
      "id": 9,
      "title": "Prywatność dzieci",
      "content": "Food ID nie zbiera świadomie żadnych informacji osobistych od dzieci. Aplikacja jest zaprojektowana do użytku przez każdego, a ponieważ żadne dane osobowe nie są zbierane ani przesyłane, jest bezpieczna dla użytkowników w każdym wieku."
    },
    {
      "id": 10,
      "title": "Zmiany w polityce prywatności",
      "content": "Możemy od czasu do czasu aktualizować tę Politykę prywatności. Poinformujemy Cię o wszelkich zmianach, aktualizując datę 'Ostatnia aktualizacja' na górze tej polityki. Zachęcamy do okresowego przeglądania tej Polityki prywatności pod kątem zmian."
    },
    {
      "id": 11,
      "title": "Skontaktuj się z nami",
      "content": "Jeśli masz pytania lub obawy dotyczące tej Polityki prywatności lub naszych praktyk dotyczących danych, skontaktuj się z nami za pośrednictwem kanałów wsparcia aplikacji. Jesteśmy zobowiązani do rozwiązania wszelkich obaw dotyczących prywatności, które możesz mieć."
    }
  ]
}
