{
  "title": "Política de privacidad",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Resumen",
      "content": "Food ID se compromete a proteger su privacidad. Esta Política de Privacidad explica cómo manejamos sus datos e información cuando usa nuestra aplicación móvil. Creemos en la transparencia y queremos que comprenda exactamente cómo se usan y almacenan su información."
    },
    {
      "id": 2,
      "title": "Recopilación de datos",
      "content": "Food ID recopila datos mínimos necesarios para que la aplicación funcione. Cuando escanea un código de barras de producto, recuperamos información del producto de la base de datos pública OpenFoodFacts. No recopilamos información personal como su nombre, dirección de correo electrónico, número de teléfono o datos de ubicación."
    },
    {
      "id": 3,
      "title": "Solo almacenamiento local",
      "content": "Todos los datos generados por su uso de la aplicación se almacenan exclusivamente en su dispositivo. Esto incluye:\n\n• Historial de escaneos: Una lista de productos que ha escaneado\n• Favoritos: Productos que ha marcado como favoritos\n• Caché de productos: Información nutricional de productos que ha visto\n\nEstos datos nunca salen de su dispositivo y no se transmiten a nuestros servidores ni a terceros."
    },
    {
      "id": 4,
      "title": "Sin transmisión de datos",
      "content": "Food ID no transmite su historial de escaneos, favoritos o cualquier dato de uso personal a servidores externos. Las únicas solicitudes de red realizadas por la aplicación son a la API de OpenFoodFacts para recuperar información pública del producto basada en los códigos de barras que escanea."
    },
    {
      "id": 5,
      "title": "Uso de la cámara",
      "content": "La aplicación requiere acceso a la cámara para escanear códigos de barras de productos. La cámara se usa únicamente para el reconocimiento de códigos de barras. No se capturan, almacenan ni transmiten fotos o videos. La transmisión de la cámara se procesa localmente en su dispositivo en tiempo real."
    },
    {
      "id": 6,
      "title": "Datos de OpenFoodFacts",
      "content": "La información del producto se recupera de OpenFoodFacts, una base de datos gratuita y abierta de productos alimentarios. Cuando escanea un código de barras, la aplicación envía solo el número del código de barras a OpenFoodFacts para recuperar información del producto. No se comparten datos personales con OpenFoodFacts."
    },
    {
      "id": 7,
      "title": "Eliminación de datos",
      "content": "Usted tiene control completo sobre sus datos. Puede borrar su historial de escaneos y favoritos en cualquier momento desde la aplicación. Desinstalar la aplicación eliminará permanentemente todos los datos almacenados localmente de su dispositivo, incluyendo historial de escaneos, favoritos e información de productos en caché."
    },
    {
      "id": 8,
      "title": "Servicios de terceros",
      "content": "Food ID usa la API de OpenFoodFacts para recuperar información del producto. OpenFoodFacts es un proyecto independiente y sin fines de lucro. Por favor, consulte la política de privacidad de OpenFoodFacts para obtener información sobre sus prácticas de datos."
    },
    {
      "id": 9,
      "title": "Privacidad de menores",
      "content": "Food ID no recopila conscientemente ninguna información personal de menores. La aplicación está diseñada para ser usada por cualquier persona, y dado que no se recopilan ni transmiten datos personales, es segura para usuarios de todas las edades."
    },
    {
      "id": 10,
      "title": "Cambios en la política de privacidad",
      "content": "Podemos actualizar esta Política de Privacidad de vez en cuando. Le notificaremos de cualquier cambio actualizando la fecha de 'Última actualización' en la parte superior de esta política. Le recomendamos que revise esta Política de Privacidad periódicamente para ver cualquier cambio."
    },
    {
      "id": 11,
      "title": "Contáctenos",
      "content": "Si tiene alguna pregunta o inquietud sobre esta Política de Privacidad o nuestras prácticas de datos, por favor contáctenos a través de los canales de soporte de la aplicación. Estamos comprometidos a abordar cualquier inquietud de privacidad que pueda tener."
    }
  ]
}
