{
  "title": "Acuerdo de usuario",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Aceptación de términos",
      "content": "Al descargar, instalar o usar la aplicación móvil Food ID, usted acepta estar sujeto a estos Términos de Uso. Si no está de acuerdo con estos términos, por favor no use la aplicación."
    },
    {
      "id": 2,
      "title": "Descripción del servicio",
      "content": "Food ID es una aplicación móvil que permite a los usuarios escanear códigos de barras de productos y recuperar información nutricional de la base de datos OpenFoodFacts. La aplicación proporciona análisis nutricional, listas de ingredientes, información sobre alérgenos y evaluaciones personalizadas para ayudar a los usuarios a tomar decisiones alimentarias informadas."
    },
    {
      "id": 3,
      "title": "Responsabilidades del usuario",
      "content": "Usted es responsable de mantener la confidencialidad de su dispositivo y de todas las actividades que ocurran en su dispositivo. Usted acepta usar la aplicación solo para fines legales y de acuerdo con estos Términos. Usted acepta no hacer mal uso de la aplicación o interferir con su funcionamiento normal."
    },
    {
      "id": 4,
      "title": "Precisión de datos",
      "content": "La información del producto proviene de OpenFoodFacts, una base de datos impulsada por la comunidad. Si bien nos esforzamos por proporcionar información precisa, no podemos garantizar la integridad o precisión de todos los datos del producto. Los usuarios deben verificar información crítica, especialmente con respecto a alérgenos, con el empaque del producto o los fabricantes."
    },
    {
      "id": 4.5,
      "title": "Contribuir con datos de productos",
      "content": "Puede ayudar a mejorar la base de datos enviando productos faltantes a través de la aplicación. Cuando un producto no se encuentra, use la función Enviar Producto para agregarlo a OpenFoodFacts. Al contribuir, acepta que sus envíos estarán disponibles públicamente bajo la Licencia de Base de Datos Abierta (ODbL)."
    },
    {
      "id": 5,
      "title": "Propiedad intelectual",
      "content": "La aplicación y su contenido original, características y funcionalidad son propiedad de Food ID y están protegidos por leyes internacionales de derechos de autor, marcas registradas y otras leyes de propiedad intelectual. Los datos del producto son proporcionados por OpenFoodFacts bajo la Licencia de Base de Datos Abierta (ODbL)."
    },
    {
      "id": 6,
      "title": "Limitación de responsabilidad",
      "content": "Food ID y sus desarrolladores no serán responsables de ningún daño indirecto, incidental, especial, consecuente o punitivo resultante de su uso o incapacidad para usar la aplicación. Proporcionamos la aplicación 'tal cual' sin garantías de ningún tipo, ya sean expresas o implícitas."
    },
    {
      "id": 7,
      "title": "Cambios en los términos",
      "content": "Nos reservamos el derecho de modificar estos Términos en cualquier momento. Notificaremos a los usuarios de cualquier cambio actualizando la fecha de 'Última actualización'. Su uso continuado de la aplicación después de los cambios constituye la aceptación de los Términos modificados."
    },
    {
      "id": 8,
      "title": "Terminación",
      "content": "Podemos terminar o suspender su acceso a la aplicación inmediatamente, sin previo aviso, por cualquier motivo, incluida la violación de estos Términos. Al terminar, su derecho a usar la aplicación cesará inmediatamente."
    },
    {
      "id": 9,
      "title": "Contacto",
      "content": "Si tiene alguna pregunta sobre estos Términos, por favor contáctenos a través de los canales de soporte de la aplicación."
    }
  ]
}
