{
  "title": "Användaravtal",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Godkännande av villkor",
      "content": "Genom att ladda ner, installera eller använda Food ID mobilapplikationen godkänner du att vara bunden av dessa Användarvillkor. Om du inte godkänner dessa villkor, använd inte appen."
    },
    {
      "id": 2,
      "title": "Beskrivning av tjänsten",
      "content": "Food ID är en mobilapplikation som gör det möjligt för användare att skanna produktstreckkoder och hämta näringsinformation från OpenFoodFacts-databasen. Appen ger näringsanalys, ingredienslistor, allergeninformation och personliga bedömningar för att hjälpa användare att fatta informerade matval."
    },
    {
      "id": 3,
      "title": "Användarens ansvar",
      "content": "Du är ansvarig för att upprätthålla konfidentialiteten för din enhet och för alla aktiviteter som sker på din enhet. Du godkänner att använda appen endast för lagliga ändamål och i enlighet med dessa Villkor. Du godkänner att inte missbruka appen eller störa dess normala funktion."
    },
    {
      "id": 4,
      "title": "Datakvalitet",
      "content": "Produktinformation kommer från OpenFoodFacts, en gemenskapsdriven databas. Även om vi strävar efter att tillhandahålla korrekt information kan vi inte garantera fullständigheten eller noggrannheten av all produktdata. Användare bör verifiera kritisk information, särskilt angående allergener, med produktförpackningen eller tillverkarna."
    },
    {
      "id": 4.5,
      "title": "Bidra med produktdata",
      "content": "Du kan hjälpa till att förbättra databasen genom att skicka in saknade produkter via appen. När en produkt inte hittas, använd funktionen Skicka in produkt för att lägga till den i OpenFoodFacts. Genom att bidra godkänner du att dina inlämningar kommer att vara offentligt tillgängliga under Open Database License (ODbL)."
    },
    {
      "id": 5,
      "title": "Immateriella rättigheter",
      "content": "Appen och dess ursprungliga innehåll, funktioner och funktionalitet ägs av Food ID och skyddas av internationella upphovsrätts-, varumärkes- och andra immateriella rättighetslagar. Produktdata tillhandahålls av OpenFoodFacts under Open Database License (ODbL)."
    },
    {
      "id": 6,
      "title": "Ansvarsbegränsning",
      "content": "Food ID och dess utvecklare ska inte vara ansvariga för indirekta, tillfälliga, särskilda, följd- eller straffskador som uppstår på grund av din användning eller oförmåga att använda appen. Vi tillhandahåller appen 'som den är' utan garantier av något slag, vare sig uttryckliga eller underförstådda."
    },
    {
      "id": 7,
      "title": "Ändringar av villkor",
      "content": "Vi förbehåller oss rätten att ändra dessa Villkor när som helst. Vi kommer att meddela användare om eventuella ändringar genom att uppdatera datumet 'Senast uppdaterad'. Din fortsatta användning av appen efter ändringar innebär acceptans av de ändrade Villkoren."
    },
    {
      "id": 8,
      "title": "Uppsägning",
      "content": "Vi kan omedelbart avsluta eller suspendera din åtkomst till appen, utan föregående meddelande, av vilken anledning som helst, inklusive överträdelse av dessa Villkor. Vid uppsägning upphör din rätt att använda appen omedelbart."
    },
    {
      "id": 9,
      "title": "Kontakt",
      "content": "Om du har frågor om dessa Villkor, vänligen kontakta oss via appens supportkanaler."
    }
  ]
}
