{
  "title": "Privacy Policy",
  "lastUpdated": "November 13, 2024",
  "sections": [
    {
      "id": 1,
      "title": "Overview",
      "content": "FoodScanner is committed to protecting your privacy. This Privacy Policy explains how we handle your data and information when you use our mobile application. We believe in transparency and want you to understand exactly how your information is used and stored."
    },
    {
      "id": 2,
      "title": "Data Collection",
      "content": "FoodScanner collects minimal data necessary for the app to function. When you scan a product barcode, we retrieve product information from the OpenFoodFacts public database. We do not collect personal information such as your name, email address, phone number, or location data."
    },
    {
      "id": 3,
      "title": "Local Storage Only",
      "content": "All data generated by your use of the app is stored exclusively on your device. This includes:\n\n• Scan History: A list of products you've scanned\n• Favorites: Products you've marked as favorites\n• Product Cache: Nutritional information of products you've viewed\n\nThis data never leaves your device and is not transmitted to our servers or any third parties."
    },
    {
      "id": 4,
      "title": "No Data Transmission",
      "content": "FoodScanner does not transmit your scan history, favorites, or any personal usage data to external servers. The only network requests made by the app are to the OpenFoodFacts API to retrieve public product information based on barcodes you scan."
    },
    {
      "id": 5,
      "title": "Camera Usage",
      "content": "The app requires camera access to scan product barcodes. The camera is used solely for barcode recognition. No photos or videos are captured, stored, or transmitted. The camera feed is processed locally on your device in real-time."
    },
    {
      "id": 6,
      "title": "OpenFoodFacts Data",
      "content": "Product information is retrieved from OpenFoodFacts, a free and open database of food products. When you scan a barcode, the app sends only the barcode number to OpenFoodFacts to retrieve product information. No personal data is shared with OpenFoodFacts."
    },
    {
      "id": 7,
      "title": "Data Deletion",
      "content": "You have complete control over your data. You can clear your scan history and favorites at any time from within the app. Uninstalling the app will permanently delete all locally stored data from your device, including scan history, favorites, and cached product information."
    },
    {
      "id": 8,
      "title": "Third-Party Services",
      "content": "FoodScanner uses the OpenFoodFacts API to retrieve product information. OpenFoodFacts is an independent, non-profit project. Please refer to OpenFoodFacts' privacy policy for information about their data practices."
    },
    {
      "id": 9,
      "title": "Children's Privacy",
      "content": "FoodScanner does not knowingly collect any personal information from children. The app is designed to be used by anyone, and since no personal data is collected or transmitted, it is safe for users of all ages."
    },
    {
      "id": 10,
      "title": "Changes to Privacy Policy",
      "content": "We may update this Privacy Policy from time to time. We will notify you of any changes by updating the 'Last Updated' date at the top of this policy. We encourage you to review this Privacy Policy periodically for any changes."
    },
    {
      "id": 11,
      "title": "Contact Us",
      "content": "If you have any questions or concerns about this Privacy Policy or our data practices, please contact us through the app's support channels. We are committed to addressing any privacy concerns you may have."
    }
  ]
}

