{
  "title": "プライバシーポリシー",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "概要",
      "content": "Food IDは、お客様のプライバシーを保護することに取り組んでいます。このプライバシーポリシーは、モバイルアプリケーションを使用する際に、お客様のデータと情報をどのように処理するかを説明しています。透明性を信じており、お客様の情報がどのように使用され、保存されるかを正確に理解していただきたいと考えています。"
    },
    {
      "id": 2,
      "title": "データの収集",
      "content": "Food IDは、アプリが機能するために必要な最小限のデータを収集します。製品のバーコードをスキャンすると、OpenFoodFactsの公開データベースから製品情報を取得します。お名前、メールアドレス、電話番号、位置データなどの個人情報は収集しません。"
    },
    {
      "id": 3,
      "title": "ローカルストレージのみ",
      "content": "アプリの使用によって生成されたすべてのデータは、お客様のデバイスにのみ保存されます。これには以下が含まれます：\n\n• スキャン履歴：スキャンした製品のリスト\n• お気に入り：お気に入りとしてマークした製品\n• 製品キャッシュ：表示した製品の栄養情報\n\nこれらのデータはデバイスを離れることはなく、サーバーや第三者に送信されることはありません。"
    },
    {
      "id": 4,
      "title": "データの送信なし",
      "content": "Food IDは、スキャン履歴、お気に入り、または個人の使用データを外部サーバーに送信しません。アプリが行う唯一のネットワークリクエストは、スキャンしたバーコードに基づいて公開製品情報を取得するためのOpenFoodFacts APIへのものです。"
    },
    {
      "id": 5,
      "title": "カメラの使用",
      "content": "アプリは、製品のバーコードをスキャンするためにカメラへのアクセスが必要です。カメラはバーコード認識専用に使用されます。写真や動画はキャプチャ、保存、または送信されません。カメラフィードは、デバイス上でリアルタイムにローカルで処理されます。"
    },
    {
      "id": 6,
      "title": "OpenFoodFactsデータ",
      "content": "製品情報は、無料でオープンな食品データベースであるOpenFoodFactsから取得されます。バーコードをスキャンすると、アプリは製品情報を取得するためにバーコード番号のみをOpenFoodFactsに送信します。個人データはOpenFoodFactsと共有されません。"
    },
    {
      "id": 7,
      "title": "データの削除",
      "content": "お客様はデータを完全に制御できます。アプリ内からいつでもスキャン履歴とお気に入りをクリアできます。アプリをアンインストールすると、スキャン履歴、お気に入り、キャッシュされた製品情報を含む、デバイスにローカルに保存されたすべてのデータが永続的に削除されます。"
    },
    {
      "id": 8,
      "title": "第三者サービス",
      "content": "Food IDは、製品情報を取得するためにOpenFoodFacts APIを使用します。OpenFoodFactsは、独立した非営利プロジェクトです。データの取り扱いに関する情報については、OpenFoodFactsのプライバシーポリシーを参照してください。"
    },
    {
      "id": 9,
      "title": "子供のプライバシー",
      "content": "Food IDは、子供から意図的に個人情報を収集しません。アプリは誰でも使用できるように設計されており、個人データが収集または送信されないため、あらゆる年齢のユーザーにとって安全です。"
    },
    {
      "id": 10,
      "title": "プライバシーポリシーの変更",
      "content": "このプライバシーポリシーを随時更新する場合があります。このポリシーの上部の'最終更新'の日付を更新することにより、変更をお知らせします。変更については、このプライバシーポリシーを定期的に確認することをお勧めします。"
    },
    {
      "id": 11,
      "title": "お問い合わせ",
      "content": "このプライバシーポリシーまたはデータの取り扱いについてご質問やご懸念がある場合は、アプリのサポートチャネルを通じてお問い合わせください。お客様のプライバシーに関する懸念に対応することをお約束します。"
    }
  ]
}
