{
  "title": "Політика конфіденційності",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Огляд",
      "content": "Food ID зобов'язується захищати вашу конфіденційність. Ця Політика конфіденційності пояснює, як ми обробляємо ваші дані та інформацію під час використання нашого мобільного застосунку. Ми віримо в прозорість і хочемо, щоб ви точно розуміли, як використовується та зберігається ваша інформація."
    },
    {
      "id": 2,
      "title": "Збір даних",
      "content": "Food ID збирає мінімальні дані, необхідні для роботи застосунку. Коли ви скануєте штрих-код продукту, ми отримуємо інформацію про продукт з публічної бази даних OpenFoodFacts. Ми не збираємо особисту інформацію, таку як ваше ім'я, адреса електронної пошти, номер телефону або дані про місцезнаходження."
    },
    {
      "id": 3,
      "title": "Лише локальне зберігання",
      "content": "Усі дані, створені в результаті використання застосунку, зберігаються виключно на вашому пристрої. Це включає:\n\n• Історія сканувань: список продуктів, які ви відсканували\n• Обране: продукти, які ви позначили як обрані\n• Кеш продуктів: інформація про харчову цінність продуктів, які ви переглядали\n\nЦі дані ніколи не залишають ваш пристрій і не передаються на наші сервери або третім особам."
    },
    {
      "id": 4,
      "title": "Відсутність передачі даних",
      "content": "Food ID не передає вашу історію сканувань, обране або будь-які дані про використання на зовнішні сервери. Єдині мережеві запити, які робить застосунок, — це запити до API OpenFoodFacts для отримання публічної інформації про продукти на основі штрих-кодів, які ви скануєте."
    },
    {
      "id": 5,
      "title": "Використання камери",
      "content": "Застосунок потребує доступу до камери для сканування штрих-кодів продуктів. Камера використовується виключно для розпізнавання штрих-кодів. Фотографії або відео не знімаються, не зберігаються та не передаються. Відеопотік з камери обробляється локально на вашому пристрої в реальному часі."
    },
    {
      "id": 6,
      "title": "Дані OpenFoodFacts",
      "content": "Інформація про продукти отримується з OpenFoodFacts — безкоштовної та відкритої бази даних харчових продуктів. Коли ви скануєте штрих-код, застосунок надсилає лише номер штрих-коду в OpenFoodFacts для отримання інформації про продукт. Жодні особисті дані не передаються в OpenFoodFacts."
    },
    {
      "id": 7,
      "title": "Видалення даних",
      "content": "Ви маєте повний контроль над своїми даними. Ви можете очистити свою історію сканувань та обране в будь-який час безпосередньо в застосунку. Видалення застосунку назавжди видалить усі локально збережені дані з вашого пристрою, включаючи історію сканувань, обране та кешовану інформацію про продукти."
    },
    {
      "id": 8,
      "title": "Сервіси третіх осіб",
      "content": "Food ID використовує API OpenFoodFacts для отримання інформації про продукти. OpenFoodFacts — це незалежний некомерційний проект. Будь ласка, зверніться до політики конфіденційності OpenFoodFacts для отримання інформації про їх практики обробки даних."
    },
    {
      "id": 9,
      "title": "Конфіденційність дітей",
      "content": "Food ID свідомо не збирає жодної особистої інформації від дітей. Застосунок розроблений для використання будь-ким, і оскільки особисті дані не збираються та не передаються, він безпечний для користувачів будь-якого віку."
    },
    {
      "id": 10,
      "title": "Зміни в Політиці конфіденційності",
      "content": "Ми можемо час від часу оновлювати цю Політику конфіденційності. Ми повідомимо вас про будь-які зміни, оновивши дату «Останнє оновлення» в верхній частині цієї політики. Ми рекомендуємо вам періодично переглядати цю Політику конфіденційності на предмет будь-яких змін."
    },
    {
      "id": 11,
      "title": "Зв'яжіться з нами",
      "content": "Якщо у вас є питання або занепокоєння щодо цієї Політики конфіденційності або наших практик обробки даних, будь ласка, зв'яжіться з нами через канали підтримки застосунку. Ми зобов'язуємося вирішувати будь-які проблеми конфіденційності, які у вас можуть виникнути."
    }
  ]
}

