{
  "title": "Fortrolighedspolitik",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Oversigt",
      "content": "Food ID er forpligtet til at beskytte dit privatliv. Denne Fortrolighedspolitik forklarer, hvordan vi håndterer dine data og oplysninger, når du bruger vores mobilapplikation. Vi tror på gennemsigtighed og ønsker, at du forstår nøjagtigt, hvordan dine oplysninger bruges og opbevares."
    },
    {
      "id": 2,
      "title": "Dataindsamling",
      "content": "Food ID indsamler minimale data, der er nødvendige for, at appen kan fungere. Når du scanner en produktstregkode, henter vi produktinformation fra OpenFoodFacts offentlige database. Vi indsamler ikke personlige oplysninger som dit navn, e-mailadresse, telefonnummer eller lokationsdata."
    },
    {
      "id": 3,
      "title": "Kun lokal lagring",
      "content": "Alle data, der genereres af din brug af appen, gemmes udelukkende på din enhed. Dette omfatter:\n\n• Scanhistorik: En liste over produkter, du har scannet\n• Favoritter: Produkter, du har markeret som favoritter\n• Produktcache: Næringsoplysninger om produkter, du har vist\n\nDisse data forlader aldrig din enhed og overføres ikke til vores servere eller tredjeparter."
    },
    {
      "id": 4,
      "title": "Ingen dataoverførsel",
      "content": "Food ID overfører ikke din scanhistorik, favoritter eller personlige brugsdata til eksterne servere. De eneste netværksanmodninger, der foretages af appen, er til OpenFoodFacts API for at hente offentlige produktoplysninger baseret på stregkoder, du scanner."
    },
    {
      "id": 5,
      "title": "Kamerabrug",
      "content": "Appen kræver kameradgang for at scanne produktstregkoder. Kameraet bruges udelukkende til stregkodsgenkendelse. Ingen fotos eller videoer fanges, gemmes eller overføres. Kamerastrømmen behandles lokalt på din enhed i realtid."
    },
    {
      "id": 6,
      "title": "OpenFoodFacts-data",
      "content": "Produktinformation hentes fra OpenFoodFacts, en gratis og åben database med fødevareprodukter. Når du scanner en stregkode, sender appen kun stregkodsnummeret til OpenFoodFacts for at hente produktinformation. Ingen personlige data deles med OpenFoodFacts."
    },
    {
      "id": 7,
      "title": "Sletning af data",
      "content": "Du har fuld kontrol over dine data. Du kan rydde din scanhistorik og favoritter når som helst i appen. Afinstallering af appen vil permanent slette alle lokalt gemte data fra din enhed, herunder scanhistorik, favoritter og cached produktinformation."
    },
    {
      "id": 8,
      "title": "Tredjepartstjenester",
      "content": "Food ID bruger OpenFoodFacts API til at hente produktinformation. OpenFoodFacts er et uafhængigt, non-profit projekt. Se venligst OpenFoodFacts' fortrolighedspolitik for oplysninger om deres datapraksis."
    },
    {
      "id": 9,
      "title": "Børns privatliv",
      "content": "Food ID indsamler ikke bevidst personlige oplysninger fra børn. Appen er designet til at blive brugt af alle, og da ingen personlige data indsamles eller overføres, er den sikker for brugere i alle aldre."
    },
    {
      "id": 10,
      "title": "Ændringer i fortrolighedspolitikken",
      "content": "Vi kan opdatere denne Fortrolighedspolitik fra tid til anden. Vi vil underrette dig om eventuelle ændringer ved at opdatere datoen 'Sidst opdateret' øverst i denne politik. Vi opfordrer dig til at gennemgå denne Fortrolighedspolitik periodisk for eventuelle ændringer."
    },
    {
      "id": 11,
      "title": "Kontakt os",
      "content": "Hvis du har spørgsmål eller bekymringer om denne Fortrolighedspolitik eller vores datapraksis, bedes du kontakte os via appens supportkanaler. Vi er forpligtet til at adressere eventuelle privatlivsbekymringer, du måtte have."
    }
  ]
}
