{
  "title": "Gizlilik politikası",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Genel bakış",
      "content": "Food ID, gizliliğinizi korumaya kararlıdır. Bu Gizlilik Politikası, mobil uygulamamızı kullandığınızda verilerinizi ve bilgilerinizi nasıl işlediğimizi açıklar. Şeffaflığa inanıyoruz ve bilgilerinizin tam olarak nasıl kullanıldığını ve saklandığını anlamanızı istiyoruz."
    },
    {
      "id": 2,
      "title": "Veri toplama",
      "content": "Food ID, uygulamanın çalışması için gerekli minimum verileri toplar. Bir ürün barkodu taradığınızda, ürün bilgilerini OpenFoodFacts genel veritabanından alırız. Adınız, e-posta adresiniz, telefon numaranız veya konum verileriniz gibi kişisel bilgileri toplamıyoruz."
    },
    {
      "id": 3,
      "title": "Yalnızca yerel depolama",
      "content": "Uygulamayı kullanmanızdan kaynaklanan tüm veriler yalnızca cihazınızda saklanır. Bu şunları içerir:\n\n• Tarama geçmişi: Taradığınız ürünlerin listesi\n• Favoriler: Favori olarak işaretlediğiniz ürünler\n• Ürün önbelleği: Görüntülediğiniz ürünlerin beslenme bilgileri\n\nBu veriler cihazınızdan asla ayrılmaz ve sunucularımıza veya üçüncü taraflara iletilmez."
    },
    {
      "id": 4,
      "title": "Veri iletimi yok",
      "content": "Food ID, tarama geçmişinizi, favorilerinizi veya kişisel kullanım verilerinizi harici sunuculara iletmez. Uygulama tarafından yapılan tek ağ istekleri, taradığınız barkodlara dayalı olarak genel ürün bilgilerini almak için OpenFoodFacts API'sine yapılır."
    },
    {
      "id": 5,
      "title": "Kamera kullanımı",
      "content": "Uygulama, ürün barkodlarını taramak için kamera erişimi gerektirir. Kamera yalnızca barkod tanıma için kullanılır. Hiçbir fotoğraf veya video yakalanmaz, saklanmaz veya iletilmez. Kamera akışı cihazınızda gerçek zamanlı olarak yerel olarak işlenir."
    },
    {
      "id": 6,
      "title": "OpenFoodFacts verileri",
      "content": "Ürün bilgileri, ücretsiz ve açık bir gıda ürünleri veritabanı olan OpenFoodFacts'tan alınır. Bir barkod taradığınızda, uygulama yalnızca barkod numarasını ürün bilgilerini almak için OpenFoodFacts'a gönderir. OpenFoodFacts ile hiçbir kişisel veri paylaşılmaz."
    },
    {
      "id": 7,
      "title": "Veri silme",
      "content": "Verileriniz üzerinde tam kontrolünüz vardır. Tarama geçmişinizi ve favorilerinizi uygulama içinden istediğiniz zaman temizleyebilirsiniz. Uygulamayı kaldırmak, cihazınızdaki tüm yerel olarak saklanan verileri kalıcı olarak siler, tarama geçmişi, favoriler ve önbelleğe alınmış ürün bilgileri dahil."
    },
    {
      "id": 8,
      "title": "Üçüncü taraf hizmetleri",
      "content": "Food ID, ürün bilgilerini almak için OpenFoodFacts API'sini kullanır. OpenFoodFacts bağımsız, kar amacı gütmeyen bir projedir. Veri uygulamaları hakkında bilgi için lütfen OpenFoodFacts'ın gizlilik politikasına bakın."
    },
    {
      "id": 9,
      "title": "Çocukların gizliliği",
      "content": "Food ID, bilerek çocuklardan kişisel bilgi toplamaz. Uygulama herkes tarafından kullanılmak üzere tasarlanmıştır ve hiçbir kişisel veri toplanmadığı veya iletilmediği için tüm yaşlardaki kullanıcılar için güvenlidir."
    },
    {
      "id": 10,
      "title": "Gizlilik politikasındaki değişiklikler",
      "content": "Bu Gizlilik Politikasını zaman zaman güncelleyebiliriz. Bu politikanın üst kısmındaki 'Son Güncelleme' tarihini güncelleyerek sizi herhangi bir değişiklikten haberdar edeceğiz. Değişiklikler için bu Gizlilik Politikasını periyodik olarak gözden geçirmenizi öneririz."
    },
    {
      "id": 11,
      "title": "Bize ulaşın",
      "content": "Bu Gizlilik Politikası veya veri uygulamalarımız hakkında sorularınız veya endişeleriniz varsa, lütfen uygulamanın destek kanalları aracılığıyla bizimle iletişime geçin. Sahip olabileceğiniz gizlilik endişelerini ele almaya kararlıyız."
    }
  ]
}
