{
  "title": "Угода користувача",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Прийняття умов",
      "content": "Завантажуючи, встановлюючи або використовуючи мобільний застосунок Food ID, ви погоджуєтеся дотримуватися цих Умов використання. Якщо ви не згодні з цими умовами, будь ласка, не використовуйте застосунок."
    },
    {
      "id": 2,
      "title": "Опис сервісу",
      "content": "Food ID — це мобільний застосунок, який дозволяє користувачам сканувати штрих-коди продуктів та отримувати інформацію про харчову цінність з бази даних OpenFoodFacts. Застосунок надає аналіз харчової цінності, списки інгредієнтів, інформацію про алергени та персоналізовані оцінки, щоб допомогти користувачам приймати обґрунтовані рішення щодо їжі."
    },
    {
      "id": 3,
      "title": "Обов'язки користувача",
      "content": "Ви несете відповідальність за збереження конфіденційності вашого пристрою та за всі дії, що відбуваються на вашому пристрої. Ви погоджуєтеся використовувати застосунок лише для законних цілей та відповідно до цих Умов. Ви погоджуєтеся не зловживати застосунком або не втручатися в його нормальну роботу."
    },
    {
      "id": 4,
      "title": "Точність даних",
      "content": "Інформація про продукти надається з OpenFoodFacts — бази даних, яку формують користувачі. Хоча ми прагнемо надавати точну інформацію, ми не можемо гарантувати повноту або точність усіх даних про продукти. Користувачам слід перевіряти критичну інформацію, особливо щодо алергенів, за упаковкою продукту або у виробників."
    },
    {
      "id": 5,
      "title": "Інтелектуальна власність",
      "content": "Застосунок та його оригінальний контент, функції та функціональність належать Food ID і захищені міжнародними законами про авторське право, торгові марки та іншу інтелектуальну власність. Дані про продукти надаються OpenFoodFacts за ліцензією Open Database License (ODbL)."
    },
    {
      "id": 6,
      "title": "Обмеження відповідальності",
      "content": "Food ID та його розробники не несуть відповідальності за будь-які непрямі, випадкові, особливі, наслідкові або покарані збитки, що виникають внаслідок вашого використання або неможливості використання застосунку. Ми надаємо застосунок «як є» без будь-яких гарантій, явних або неявних."
    },
    {
      "id": 7,
      "title": "Зміни умов",
      "content": "Ми залишаємо за собою право змінювати ці Умови в будь-який час. Ми повідомимо користувачів про будь-які зміни, оновивши дату «Останнє оновлення». Ваше подальше використання застосунку після змін означає прийняття змінених Умов."
    },
    {
      "id": 8,
      "title": "Припинення",
      "content": "Ми можемо припинити або призупинити ваш доступ до застосунку негайно, без попереднього повідомлення, з будь-якої причини, включаючи порушення цих Умов. Після припинення ваше право на використання застосунку негайно припиняється."
    },
    {
      "id": 9,
      "title": "Контакти",
      "content": "Якщо у вас є питання щодо цих Умов, будь ласка, зв'яжіться з нами через канали підтримки застосунку."
    }
  ]
}
