{
  "title": "Accord utilisateur",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Acceptation des conditions",
      "content": "En téléchargeant, installant ou utilisant l'application mobile Food ID, vous acceptez d'être lié par ces Conditions d'utilisation. Si vous n'acceptez pas ces conditions, veuillez ne pas utiliser l'application."
    },
    {
      "id": 2,
      "title": "Description du service",
      "content": "Food ID est une application mobile qui permet aux utilisateurs de scanner les codes-barres des produits et de récupérer des informations nutritionnelles à partir de la base de données OpenFoodFacts. L'application fournit une analyse nutritionnelle, des listes d'ingrédients, des informations sur les allergènes et des évaluations personnalisées pour aider les utilisateurs à faire des choix alimentaires éclairés."
    },
    {
      "id": 3,
      "title": "Responsabilités de l'utilisateur",
      "content": "Vous êtes responsable de maintenir la confidentialité de votre appareil et de toutes les activités qui se produisent sur votre appareil. Vous acceptez d'utiliser l'application uniquement à des fins légales et conformément à ces Conditions. Vous acceptez de ne pas faire un mauvais usage de l'application ou d'interférer avec son fonctionnement normal."
    },
    {
      "id": 4,
      "title": "Exactitude des données",
      "content": "Les informations sur les produits proviennent d'OpenFoodFacts, une base de données gérée par la communauté. Bien que nous nous efforcions de fournir des informations précises, nous ne pouvons pas garantir l'exhaustivité ou l'exactitude de toutes les données des produits. Les utilisateurs doivent vérifier les informations critiques, en particulier concernant les allergènes, avec l'emballage du produit ou les fabricants."
    },
    {
      "id": 5,
      "title": "Propriété intellectuelle",
      "content": "L'application et son contenu original, ses fonctionnalités et sa fonctionnalité appartiennent à Food ID et sont protégés par les lois internationales sur le droit d'auteur, les marques de commerce et autres lois sur la propriété intellectuelle. Les données des produits sont fournies par OpenFoodFacts sous la licence Open Database License (ODbL)."
    },
    {
      "id": 6,
      "title": "Limitation de responsabilité",
      "content": "Food ID et ses développeurs ne seront pas responsables de tout dommage indirect, accessoire, spécial, consécutif ou punitif résultant de votre utilisation ou de votre incapacité à utiliser l'application. Nous fournissons l'application 'telle quelle' sans garanties d'aucune sorte, expresses ou implicites."
    },
    {
      "id": 7,
      "title": "Modifications des conditions",
      "content": "Nous nous réservons le droit de modifier ces Conditions à tout moment. Nous informerons les utilisateurs de tout changement en mettant à jour la date de 'Dernière mise à jour'. Votre utilisation continue de l'application après les modifications constitue une acceptation des Conditions modifiées."
    },
    {
      "id": 8,
      "title": "Résiliation",
      "content": "Nous pouvons résilier ou suspendre votre accès à l'application immédiatement, sans préavis, pour quelque raison que ce soit, y compris la violation de ces Conditions. Lors de la résiliation, votre droit d'utiliser l'application cessera immédiatement."
    },
    {
      "id": 9,
      "title": "Contact",
      "content": "Si vous avez des questions concernant ces Conditions, veuillez nous contacter via les canaux de support de l'application."
    }
  ]
}
