{
  "title": "Acordo do usuário",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Aceitação dos termos",
      "content": "Ao baixar, instalar ou usar o aplicativo móvel Food ID, você concorda em estar vinculado a estes Termos de Uso. Se você não concordar com estes termos, por favor não use o aplicativo."
    },
    {
      "id": 2,
      "title": "Descrição do serviço",
      "content": "Food ID é um aplicativo móvel que permite aos usuários escanear códigos de barras de produtos e recuperar informações nutricionais do banco de dados OpenFoodFacts. O aplicativo fornece análise nutricional, listas de ingredientes, informações sobre alérgenos e avaliações personalizadas para ajudar os usuários a fazer escolhas alimentares informadas."
    },
    {
      "id": 3,
      "title": "Responsabilidades do usuário",
      "content": "Você é responsável por manter a confidencialidade do seu dispositivo e por todas as atividades que ocorrem no seu dispositivo. Você concorda em usar o aplicativo apenas para fins legais e de acordo com estes Termos. Você concorda em não fazer uso indevido do aplicativo ou interferir em sua operação normal."
    },
    {
      "id": 4,
      "title": "Precisão dos dados",
      "content": "As informações do produto são provenientes do OpenFoodFacts, um banco de dados orientado pela comunidade. Embora nos esforcemos para fornecer informações precisas, não podemos garantir a integridade ou precisão de todos os dados do produto. Os usuários devem verificar informações críticas, especialmente sobre alérgenos, com a embalagem do produto ou fabricantes."
    },
    {
      "id": 5,
      "title": "Propriedade intelectual",
      "content": "O aplicativo e seu conteúdo original, recursos e funcionalidade são de propriedade do Food ID e são protegidos por leis internacionais de direitos autorais, marcas registradas e outras leis de propriedade intelectual. Os dados do produto são fornecidos pelo OpenFoodFacts sob a Licença de Banco de Dados Aberto (ODbL)."
    },
    {
      "id": 6,
      "title": "Limitação de responsabilidade",
      "content": "Food ID e seus desenvolvedores não serão responsáveis por quaisquer danos indiretos, incidentais, especiais, consequenciais ou punitivos resultantes do seu uso ou incapacidade de usar o aplicativo. Fornecemos o aplicativo 'como está' sem garantias de qualquer tipo, expressas ou implícitas."
    },
    {
      "id": 7,
      "title": "Alterações nos termos",
      "content": "Reservamo-nos o direito de modificar estes Termos a qualquer momento. Notificaremos os usuários sobre quaisquer alterações atualizando a data de 'Última atualização'. Seu uso continuado do aplicativo após as alterações constitui aceitação dos Termos modificados."
    },
    {
      "id": 8,
      "title": "Rescisão",
      "content": "Podemos encerrar ou suspender seu acesso ao aplicativo imediatamente, sem aviso prévio, por qualquer motivo, incluindo violação destes Termos. Após a rescisão, seu direito de usar o aplicativo cessará imediatamente."
    },
    {
      "id": 9,
      "title": "Contato",
      "content": "Se você tiver alguma dúvida sobre estes Termos, entre em contato conosco através dos canais de suporte do aplicativo."
    }
  ]
}
