{
  "title": "उपयोगकर्ता समझौता",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "शर्तों की स्वीकृति",
      "content": "Food ID मोबाइल एप्लिकेशन को डाउनलोड, इंस्टॉल या उपयोग करके, आप इन उपयोग की शर्तों से बाध्य होने के लिए सहमत हैं। यदि आप इन शर्तों से सहमत नहीं हैं, कृपया ऐप का उपयोग न करें।"
    },
    {
      "id": 2,
      "title": "सेवा का विवरण",
      "content": "Food ID एक मोबाइल एप्लिकेशन है जो उपयोगकर्ताओं को उत्पाद बारकोड स्कैन करने और OpenFoodFacts डेटाबेस से पोषण जानकारी पुनर्प्राप्त करने की अनुमति देता है। ऐप पोषण विश्लेषण, सामग्री सूचियाँ, एलर्जेन जानकारी और व्यक्तिगत मूल्यांकन प्रदान करता है ताकि उपयोगकर्ताओं को सूचित भोजन विकल्प बनाने में मदद मिल सके।"
    },
    {
      "id": 3,
      "title": "उपयोगकर्ता जिम्मेदारियां",
      "content": "आप अपने डिवाइस की गोपनीयता बनाए रखने और अपने डिवाइस पर होने वाली सभी गतिविधियों के लिए जिम्मेदार हैं। आप सहमत हैं कि ऐप का उपयोग केवल कानूनी उद्देश्यों के लिए और इन शर्तों के अनुसार करेंगे। आप सहमत हैं कि ऐप का दुरुपयोग नहीं करेंगे या इसके सामान्य संचालन में हस्तक्षेप नहीं करेंगे।"
    },
    {
      "id": 4,
      "title": "डेटा सटीकता",
      "content": "उत्पाद जानकारी OpenFoodFacts से आती है, जो एक समुदाय-संचालित डेटाबेस है। हालांकि हम सटीक जानकारी प्रदान करने का प्रयास करते हैं, हम सभी उत्पाद डेटा की पूर्णता या सटीकता की गारंटी नहीं दे सकते। उपयोगकर्ताओं को महत्वपूर्ण जानकारी, विशेष रूप से एलर्जेन के बारे में, उत्पाद पैकेजिंग या निर्माताओं के साथ सत्यापित करना चाहिए।"
    },
    {
      "id": 5,
      "title": "बौद्धिक संपदा",
      "content": "ऐप और इसकी मूल सामग्री, सुविधाएं और कार्यक्षमता Food ID के स्वामित्व में हैं और अंतर्राष्ट्रीय कॉपीराइट, ट्रेडमार्क और अन्य बौद्धिक संपदा कानूनों द्वारा संरक्षित हैं। उत्पाद डेटा Open Database License (ODbL) के तहत OpenFoodFacts द्वारा प्रदान किया जाता है।"
    },
    {
      "id": 6,
      "title": "दायित्व सीमा",
      "content": "Food ID और इसके डेवलपर्स आपके ऐप के उपयोग या उपयोग करने में असमर्थता के परिणामस्वरूप किसी भी अप्रत्यक्ष, आकस्मिक, विशेष, परिणामी या दंडात्मक नुकसान के लिए उत्तरदायी नहीं होंगे। हम ऐप को 'जैसा है' किसी भी प्रकार की गारंटी के बिना, स्पष्ट या निहित प्रदान करते हैं।"
    },
    {
      "id": 7,
      "title": "शर्तों में परिवर्तन",
      "content": "हम किसी भी समय इन शर्तों को संशोधित करने का अधिकार सुरक्षित रखते हैं। हम 'अंतिम अपडेट' की तारीख अपडेट करके उपयोगकर्ताओं को किसी भी परिवर्तन के बारे में सूचित करेंगे। परिवर्तनों के बाद ऐप का आपका निरंतर उपयोग संशोधित शर्तों की स्वीकृति का गठन करता है।"
    },
    {
      "id": 8,
      "title": "समाप्ति",
      "content": "हम किसी भी कारण से, इन शर्तों के उल्लंघन सहित, बिना पूर्व सूचना के तुरंत ऐप तक आपकी पहुंच को समाप्त या निलंबित कर सकते हैं। समाप्ति पर, ऐप का उपयोग करने का आपका अधिकार तुरंत समाप्त हो जाएगा।"
    },
    {
      "id": 9,
      "title": "संपर्क",
      "content": "यदि इन शर्तों के बारे में आपके कोई प्रश्न हैं, कृपया ऐप के सहायता चैनलों के माध्यम से हमसे संपर्क करें।"
    }
  ]
}
