{
  "title": "Informativa sulla privacy",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Panoramica",
      "content": "Food ID si impegna a proteggere la tua privacy. Questa Informativa sulla privacy spiega come gestiamo i tuoi dati e le tue informazioni quando usi la nostra applicazione mobile. Crediamo nella trasparenza e vogliamo che tu capisca esattamente come le tue informazioni vengono utilizzate e archiviate."
    },
    {
      "id": 2,
      "title": "Raccolta di dati",
      "content": "Food ID raccoglie dati minimi necessari per il funzionamento dell'app. Quando scansioni un codice a barre di un prodotto, recuperiamo le informazioni sul prodotto dal database pubblico OpenFoodFacts. Non raccogliamo informazioni personali come il tuo nome, indirizzo email, numero di telefono o dati di localizzazione."
    },
    {
      "id": 3,
      "title": "Solo archiviazione locale",
      "content": "Tutti i dati generati dal tuo utilizzo dell'app sono archiviati esclusivamente sul tuo dispositivo. Ciò include:\n\n• Cronologia delle scansioni: Un elenco di prodotti che hai scansionato\n• Preferiti: Prodotti che hai contrassegnato come preferiti\n• Cache dei prodotti: Informazioni nutrizionali dei prodotti che hai visualizzato\n\nQuesti dati non lasciano mai il tuo dispositivo e non vengono trasmessi ai nostri server o a terze parti."
    },
    {
      "id": 4,
      "title": "Nessuna trasmissione di dati",
      "content": "Food ID non trasmette la tua cronologia di scansioni, preferiti o dati di utilizzo personali a server esterni. Le uniche richieste di rete effettuate dall'app sono all'API OpenFoodFacts per recuperare informazioni pubbliche sui prodotti basate sui codici a barre che scansiona."
    },
    {
      "id": 5,
      "title": "Utilizzo della fotocamera",
      "content": "L'app richiede l'accesso alla fotocamera per scansionare i codici a barre dei prodotti. La fotocamera viene utilizzata esclusivamente per il riconoscimento dei codici a barre. Nessuna foto o video viene catturato, archiviato o trasmesso. Il feed della fotocamera viene elaborato localmente sul tuo dispositivo in tempo reale."
    },
    {
      "id": 6,
      "title": "Dati OpenFoodFacts",
      "content": "Le informazioni sui prodotti vengono recuperate da OpenFoodFacts, un database gratuito e aperto di prodotti alimentari. Quando scansioni un codice a barre, l'app invia solo il numero del codice a barre a OpenFoodFacts per recuperare le informazioni sul prodotto. Nessun dato personale viene condiviso con OpenFoodFacts."
    },
    {
      "id": 7,
      "title": "Eliminazione dei dati",
      "content": "Hai il controllo completo sui tuoi dati. Puoi cancellare la tua cronologia di scansioni e preferiti in qualsiasi momento dall'app. Disinstallare l'app eliminerà permanentemente tutti i dati archiviati localmente dal tuo dispositivo, inclusi cronologia di scansioni, preferiti e informazioni sui prodotti in cache."
    },
    {
      "id": 8,
      "title": "Servizi di terze parti",
      "content": "Food ID utilizza l'API OpenFoodFacts per recuperare informazioni sui prodotti. OpenFoodFacts è un progetto indipendente senza scopo di lucro. Si prega di fare riferimento alla politica sulla privacy di OpenFoodFacts per informazioni sulle loro pratiche sui dati."
    },
    {
      "id": 9,
      "title": "Privacy dei bambini",
      "content": "Food ID non raccoglie consapevolmente informazioni personali dai bambini. L'app è progettata per essere utilizzata da chiunque e, poiché non vengono raccolti o trasmessi dati personali, è sicura per gli utenti di tutte le età."
    },
    {
      "id": 10,
      "title": "Modifiche all'informativa sulla privacy",
      "content": "Possiamo aggiornare questa Informativa sulla privacy di tanto in tanto. Ti informeremo di eventuali modifiche aggiornando la data 'Ultimo aggiornamento' in cima a questa politica. Ti incoraggiamo a rivedere periodicamente questa Informativa sulla privacy per eventuali modifiche."
    },
    {
      "id": 11,
      "title": "Contattaci",
      "content": "Se hai domande o preoccupazioni riguardo a questa Informativa sulla privacy o alle nostre pratiche sui dati, ti preghiamo di contattarci tramite i canali di supporto dell'app. Siamo impegnati ad affrontare eventuali preoccupazioni sulla privacy che potresti avere."
    }
  ]
}
