{
  "title": "Politique de confidentialité",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Vue d'ensemble",
      "content": "Food ID s'engage à protéger votre vie privée. Cette Politique de confidentialité explique comment nous gérons vos données et informations lorsque vous utilisez notre application mobile. Nous croyons en la transparence et voulons que vous compreniez exactement comment vos informations sont utilisées et stockées."
    },
    {
      "id": 2,
      "title": "Collecte de données",
      "content": "Food ID collecte des données minimales nécessaires au fonctionnement de l'application. Lorsque vous scannez un code-barres de produit, nous récupérons les informations du produit à partir de la base de données publique OpenFoodFacts. Nous ne collectons pas d'informations personnelles telles que votre nom, votre adresse e-mail, votre numéro de téléphone ou vos données de localisation."
    },
    {
      "id": 3,
      "title": "Stockage local uniquement",
      "content": "Toutes les données générées par votre utilisation de l'application sont stockées exclusivement sur votre appareil. Cela comprend :\n\n• Historique des scans : Une liste des produits que vous avez scannés\n• Favoris : Produits que vous avez marqués comme favoris\n• Cache des produits : Informations nutritionnelles des produits que vous avez consultés\n\nCes données ne quittent jamais votre appareil et ne sont pas transmises à nos serveurs ou à des tiers."
    },
    {
      "id": 4,
      "title": "Aucune transmission de données",
      "content": "Food ID ne transmet pas votre historique de scans, vos favoris ou toute donnée d'utilisation personnelle à des serveurs externes. Les seules requêtes réseau effectuées par l'application sont à l'API OpenFoodFacts pour récupérer des informations publiques sur les produits basées sur les codes-barres que vous scannez."
    },
    {
      "id": 5,
      "title": "Utilisation de la caméra",
      "content": "L'application nécessite l'accès à la caméra pour scanner les codes-barres des produits. La caméra est utilisée uniquement pour la reconnaissance des codes-barres. Aucune photo ou vidéo n'est capturée, stockée ou transmise. Le flux de la caméra est traité localement sur votre appareil en temps réel."
    },
    {
      "id": 6,
      "title": "Données OpenFoodFacts",
      "content": "Les informations sur les produits sont récupérées depuis OpenFoodFacts, une base de données gratuite et ouverte de produits alimentaires. Lorsque vous scannez un code-barres, l'application envoie uniquement le numéro du code-barres à OpenFoodFacts pour récupérer les informations du produit. Aucune donnée personnelle n'est partagée avec OpenFoodFacts."
    },
    {
      "id": 7,
      "title": "Suppression des données",
      "content": "Vous avez un contrôle total sur vos données. Vous pouvez effacer votre historique de scans et vos favoris à tout moment depuis l'application. La désinstallation de l'application supprimera définitivement toutes les données stockées localement de votre appareil, y compris l'historique des scans, les favoris et les informations sur les produits en cache."
    },
    {
      "id": 8,
      "title": "Services tiers",
      "content": "Food ID utilise l'API OpenFoodFacts pour récupérer les informations sur les produits. OpenFoodFacts est un projet indépendant à but non lucratif. Veuillez consulter la politique de confidentialité d'OpenFoodFacts pour obtenir des informations sur leurs pratiques en matière de données."
    },
    {
      "id": 9,
      "title": "Confidentialité des enfants",
      "content": "Food ID ne collecte pas sciemment d'informations personnelles auprès d'enfants. L'application est conçue pour être utilisée par n'importe qui, et comme aucune donnée personnelle n'est collectée ou transmise, elle est sûre pour les utilisateurs de tous âges."
    },
    {
      "id": 10,
      "title": "Modifications de la politique de confidentialité",
      "content": "Nous pouvons mettre à jour cette Politique de confidentialité de temps à autre. Nous vous informerons de tout changement en mettant à jour la date de 'Dernière mise à jour' en haut de cette politique. Nous vous encourageons à consulter cette Politique de confidentialité périodiquement pour tout changement."
    },
    {
      "id": 11,
      "title": "Nous contacter",
      "content": "Si vous avez des questions ou des préoccupations concernant cette Politique de confidentialité ou nos pratiques en matière de données, veuillez nous contacter via les canaux de support de l'application. Nous nous engageons à répondre à toute préoccupation de confidentialité que vous pourriez avoir."
    }
  ]
}
