{
  "title": "Politica de confidențialitate",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Prezentare generală",
      "content": "Food ID este angajat să vă protejeze confidențialitatea. Această Politică de confidențialitate explică modul în care gestionăm datele și informațiile dvs. când utilizați aplicația noastră mobilă. Credem în transparență și vrem să înțelegeți exact modul în care informațiile dvs. sunt utilizate și stocate."
    },
    {
      "id": 2,
      "title": "Colectarea datelor",
      "content": "Food ID colectează date minime necesare pentru ca aplicația să funcționeze. Când scanați un cod de bare al unui produs, recuperăm informații despre produs din baza de date publică OpenFoodFacts. Nu colectăm informații personale precum numele dvs., adresa de e-mail, numărul de telefon sau datele de localizare."
    },
    {
      "id": 3,
      "title": "Doar stocare locală",
      "content": "Toate datele generate de utilizarea aplicației sunt stocate exclusiv pe dispozitivul dvs. Aceasta include:\n\n• Istoricul scanărilor: O listă de produse pe care le-ați scanat\n• Favorite: Produse pe care le-ați marcat ca favorite\n• Cache-ul produselor: Informații nutriționale despre produsele pe care le-ați vizualizat\n\nAceste date nu părăsesc niciodată dispozitivul dvs. și nu sunt transmise către serverele noastre sau către terți."
    },
    {
      "id": 4,
      "title": "Fără transmitere de date",
      "content": "Food ID nu transmite istoricul dvs. de scanări, favoritele sau orice date de utilizare personală către servere externe. Singurele solicitări de rețea făcute de aplicație sunt către API-ul OpenFoodFacts pentru a recupera informații publice despre produse pe baza codurilor de bare pe care le scanați."
    },
    {
      "id": 5,
      "title": "Utilizarea camerei",
      "content": "Aplicația necesită acces la cameră pentru a scana codurile de bare ale produselor. Camera este folosită exclusiv pentru recunoașterea codurilor de bare. Nu sunt capturate, stocate sau transmise fotografii sau videoclipuri. Fluxul camerei este procesat local pe dispozitivul dvs. în timp real."
    },
    {
      "id": 6,
      "title": "Date OpenFoodFacts",
      "content": "Informațiile despre produse sunt recuperate de la OpenFoodFacts, o bază de date gratuită și deschisă de produse alimentare. Când scanați un cod de bare, aplicația trimite doar numărul codului de bare către OpenFoodFacts pentru a recupera informații despre produs. Nu sunt partajate date personale cu OpenFoodFacts."
    },
    {
      "id": 7,
      "title": "Ștergerea datelor",
      "content": "Aveți control complet asupra datelor dvs. Puteți șterge istoricul dvs. de scanări și favoritele în orice moment din aplicație. Dezinstalarea aplicației va șterge permanent toate datele stocate local de pe dispozitivul dvs., inclusiv istoricul scanărilor, favoritele și informațiile despre produse din cache."
    },
    {
      "id": 8,
      "title": "Servicii terțe",
      "content": "Food ID folosește API-ul OpenFoodFacts pentru a recupera informații despre produse. OpenFoodFacts este un proiect independent, nonprofit. Vă rugăm să consultați politica de confidențialitate a OpenFoodFacts pentru informații despre practicile lor privind datele."
    },
    {
      "id": 9,
      "title": "Confidențialitatea copiilor",
      "content": "Food ID nu colectează în mod conștient informații personale de la copii. Aplicația este concepută să fie folosită de oricine și, deoarece nu sunt colectate sau transmise date personale, este sigură pentru utilizatorii de toate vârstele."
    },
    {
      "id": 10,
      "title": "Modificări ale politicii de confidențialitate",
      "content": "Putem actualiza această Politică de confidențialitate din când în când. Vă vom notifica despre orice modificări prin actualizarea datei 'Ultima actualizare' din partea de sus a acestei politici. Vă încurajăm să revizuiți periodic această Politică de confidențialitate pentru orice modificări."
    },
    {
      "id": 11,
      "title": "Contactați-ne",
      "content": "Dacă aveți întrebări sau preocupări despre această Politică de confidențialitate sau practicile noastre privind datele, vă rugăm să ne contactați prin canalele de suport ale aplicației. Suntem angajați să abordăm orice preocupări de confidențialitate pe care le-ați putea avea."
    }
  ]
}
