{
  "title": "Acordul utilizatorului",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Acceptarea termenilor",
      "content": "Prin descărcarea, instalarea sau utilizarea aplicației mobile Food ID, sunteți de acord să fiți obligat de acești Termeni de utilizare. Dacă nu sunteți de acord cu acești termeni, vă rugăm să nu utilizați aplicația."
    },
    {
      "id": 2,
      "title": "Descrierea serviciului",
      "content": "Food ID este o aplicație mobilă care permite utilizatorilor să scaneze codurile de bare ale produselor și să recupereze informații nutriționale din baza de date OpenFoodFacts. Aplicația oferă analiză nutrițională, liste de ingrediente, informații despre alergeni și evaluări personalizate pentru a ajuta utilizatorii să facă alegeri alimentare informate."
    },
    {
      "id": 3,
      "title": "Responsabilitățile utilizatorului",
      "content": "Sunteți responsabil pentru menținerea confidențialității dispozitivului dvs. și pentru toate activitățile care au loc pe dispozitivul dvs. Sunteți de acord să utilizați aplicația doar în scopuri legale și în conformitate cu acești Termeni. Sunteți de acord să nu abuzați de aplicație sau să interferați cu funcționarea sa normală."
    },
    {
      "id": 4,
      "title": "Acuratețea datelor",
      "content": "Informațiile despre produse provin din OpenFoodFacts, o bază de date condusă de comunitate. Deși ne străduim să oferim informații precise, nu putem garanta completitudinea sau acuratețea tuturor datelor despre produse. Utilizatorii ar trebui să verifice informațiile critice, în special cu privire la alergeni, cu ambalajul produsului sau producătorii."
    },
    {
      "id": 4.5,
      "title": "Contribuirea la datele despre produse",
      "content": "Puteți ajuta la îmbunătățirea bazei de date prin trimiterea produselor lipsă prin aplicație. Când un produs nu este găsit, folosiți funcția Trimite Produs pentru a-l adăuga la OpenFoodFacts. Contribuind, acceptați că trimiterile dvs. vor fi disponibile public sub licența Open Database License (ODbL)."
    },
    {
      "id": 5,
      "title": "Proprietate intelectuală",
      "content": "Aplicația și conținutul, caracteristicile și funcționalitatea sa originală aparțin Food ID și sunt protejate de legile internaționale privind drepturile de autor, mărcile comerciale și alte legi de proprietate intelectuală. Datele despre produse sunt furnizate de OpenFoodFacts sub licența Open Database License (ODbL)."
    },
    {
      "id": 6,
      "title": "Limitarea răspunderii",
      "content": "Food ID și dezvoltatorii săi nu vor fi răspunzători pentru orice daune indirecte, accidentale, speciale, consecvențiale sau punitive rezultate din utilizarea sau incapacitatea dvs. de a utiliza aplicația. Oferim aplicația 'așa cum este' fără garanții de orice fel, fie exprese, fie implicite."
    },
    {
      "id": 7,
      "title": "Modificări ale termenilor",
      "content": "Ne rezervăm dreptul de a modifica acești Termeni în orice moment. Vom notifica utilizatorii despre orice modificări prin actualizarea datei 'Ultima actualizare'. Utilizarea continuă a aplicației după modificări constituie acceptarea Termenilor modificați."
    },
    {
      "id": 8,
      "title": "Reziliere",
      "content": "Putem rezilia sau suspenda accesul dvs. la aplicație imediat, fără notificare prealabilă, din orice motiv, inclusiv încălcarea acestor Termeni. La reziliere, dreptul dvs. de a utiliza aplicația va înceta imediat."
    },
    {
      "id": 9,
      "title": "Contact",
      "content": "Dacă aveți întrebări despre acești Termeni, vă rugăm să ne contactați prin canalele de suport ale aplicației."
    }
  ]
}
