{
  "title": "Uživatelská smlouva",
  "lastUpdated": "2025-12-03",
  "sections": [
    {
      "id": 1,
      "title": "Přijetí podmínek",
      "content": "Stažením, instalací nebo použitím mobilní aplikace Food ID souhlasíte s tím, že jste vázáni těmito Podmínkami použití. Pokud s těmito podmínkami nesouhlasíte, prosím nepoužívejte aplikaci."
    },
    {
      "id": 2,
      "title": "Popis služby",
      "content": "Food ID je mobilní aplikace, která umožňuje uživatelům skenovat čárové kódy produktů a získávat nutriční informace z databáze OpenFoodFacts. Aplikace poskytuje nutriční analýzu, seznamy ingrediencí, informace o alergenech a personalizovaná hodnocení, aby pomohla uživatelům činit informovaná rozhodnutí o jídle."
    },
    {
      "id": 3,
      "title": "Odpovědnosti uživatele",
      "content": "Jste odpovědní za zachování důvěrnosti vašeho zařízení a za všechny aktivity, které se vyskytují na vašem zařízení. Souhlasíte s používáním aplikace pouze pro zákonné účely a v souladu s těmito Podmínkami. Souhlasíte, že nebudete zneužívat aplikaci nebo narušovat její normální provoz."
    },
    {
      "id": 4,
      "title": "Přesnost dat",
      "content": "Informace o produktech pocházejí z OpenFoodFacts, databáze řízené komunitou. I když se snažíme poskytovat přesné informace, nemůžeme zaručit úplnost nebo přesnost všech dat produktů. Uživatelé by měli ověřit kritické informace, zejména týkající se alergenů, s obalem produktu nebo výrobci."
    },
    {
      "id": 5,
      "title": "Duševní vlastnictví",
      "content": "Aplikace a její původní obsah, funkce a funkcionalita jsou vlastnictvím Food ID a jsou chráněny mezinárodními autorskými právy, ochrannými známkami a dalšími zákony o duševním vlastnictví. Data produktů jsou poskytována společností OpenFoodFacts pod licencí Open Database License (ODbL)."
    },
    {
      "id": 6,
      "title": "Omezení odpovědnosti",
      "content": "Food ID a jeho vývojáři nebudou odpovědni za jakékoli nepřímé, náhodné, zvláštní, následné nebo trestní škody vyplývající z vašeho používání nebo neschopnosti používat aplikaci. Poskytujeme aplikaci 'tak, jak je' bez jakýchkoli záruk, ať už výslovných nebo předpokládaných."
    },
    {
      "id": 7,
      "title": "Změny podmínek",
      "content": "Vyhrazujeme si právo tyto Podmínky kdykoli upravit. Uživatele budeme informovat o jakýchkoli změnách aktualizací data 'Poslední aktualizace'. Vaše pokračující používání aplikace po změnách představuje přijetí upravených Podmínek."
    },
    {
      "id": 8,
      "title": "Ukončení",
      "content": "Můžeme okamžitě ukončit nebo pozastavit váš přístup k aplikaci bez předchozího upozornění z jakéhokoli důvodu, včetně porušení těchto Podmínek. Při ukončení vaše právo používat aplikaci okamžitě zanikne."
    },
    {
      "id": 9,
      "title": "Kontakt",
      "content": "Pokud máte jakékoli dotazy týkající se těchto Podmínek, kontaktujte nás prosím prostřednictvím kanálů podpory aplikace."
    }
  ]
}
